Repository: mahmadii0/Cafe-Mafia-bot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fa

source: I'm in✋
fa: من هستم✋

source: Final start👁️‍🗨️
fa: شروع نهایی👁️‍🗨️

source: Wow! What an awesome group of friends gathering to play Mafia! 😎 To join the game, first, you need to start the bot and then click on the "I am in" button so we can play this exciting scenario! Scenario: The Godfather 3 Number of Citizens** (Doctor, Leon, Kane, Constantine, Regular): 7 Number of Mafia** (Godfather, Matador, Saul Goodman): 3 Independent Role** (Sherlock): 1 If you don’t know the game or are unfamiliar with it, use the command `/helpG` for an explanation.
fa: به به چه دوستانی قراره دورهم مافیا بازی کنن!😎 برای شرکت داخل بازی،ابتدا باید ربات رو استارت کرده باشید و سپس روی دکمه من هستم کلیک کنین تا این سناریو جذاب رو بازی کنیم!سناریو: پدرخوانده3تعداد شهروندان(دکتر،لئون،کین،کنستانتین،ساده): 7تعداد مافیا(پدرخوانده،ماتادور،ساول گودمن): 3نقش مستقل(شرلوک): 1 *اگر بازی رو نمی دونید و آَشنایی ندارید از دستور /helpG استفاده کنید تا توضیح بدم.

source: Wow! What an awesome group of friends gathering to play Mafia! 😎 To join the game, first, you need to start the bot and then click on the "I am in" button so we can play this exciting scenario! Scenario: The Godfather 3 Number of Citizens** (Doctor, Leon, Kane, Constantine, Regular): 7 Number of Mafia** (Godfather, Matador, Saul Goodman): 3 Independent Role** (Sherlock): 1 If you don’t know the game or are unfamiliar with it, use the command `/helpG` for an explanation. Player List: {}
fa: به به چه دوستانی قراره دورهم مافیا بازی کنن!😎 برای شرکت داخل بازی،ابتدا باید ربات رو استارت کرده باشید و سپس روی دکمه من هستم کلیک کنین تا این سناریو جذاب رو بازی کنیم! سناریو: پدرخوانده3تعداد شهروندان(دکتر،لئون،کین،کنستانتین،ساده): 7تعداد مافیا(پدرخوانده،ماتادور،ساول گودمن): 3نقش مستقل(شرلوک): 1 *اگر بازی رو نمی دونید و آَشنایی ندارید از دستور /helpG استفاده کنید تا توضیح بدم. لیست بازیکنان: {}

source: Dear friend, you'r in the game! Please wait for it to start
fa: دوست عزیز شما در بازی هستید!منتظر شروع آن باشید

source: Dear friend, you haven't start the bot
fa: دوست عزیز شما ربات را استارت نکرده اید!

source: You can't join to game!
fa: شما دیگر نمی توانید اضافه شوید!

source: GAME is started!
fa: بازی شروع شد!

source: The required number of players has not been reached!
fa: تعداد به حد نصاب نرسیده است!

source: You don't have premission to start the game!
fa: شما مجوز شروع بازی را ندارید!

source: Godfather
fa: پدرخوانده

source: Matador
fa: ماتادور

source: Sual Goodman
fa: ساول گودمن

source: Mafia
fa: مافیا

source: Sherlock
fa: شرلوک

source: Citizen
fa: شهروند

source: Your role dear friend is:
fa: نقش شما دوست عزیز🗿:

source: Welcome to the game, everyone😎 I'm delighted to have an enjoyable game with you all🪶 Your roles have been sent to you privately by me. Now, we will begin the Blind Day in 5 seconds.If you have finished speaking, let me know by typing the word End speech
fa: به همگی دوستان داخل بازی خوش آمد میگم😎 از اینکه قراره یک بازی لذت بخش با شما رو داشته باشم خشنودم🪶 دوستان نقش ها داخل پیوی شما توسط من اعلام شده و اکنون روز بلایند(ناآگاهی یا کوری) رو تا 5 ثانیه دیگه شروع می کنیم. اگر صحبت شما تمام شد با نوشتن کلمه اتمام کلام من رو آگاه کنید

source: Night has begun... The city falls asleep...🌙
fa: شب آغاز شد... شهر به خواب بره...🌙

source: Yes
fa: بله

source: 🔴Do you want to make an inquiry?
fa: 🔴آیا استعلام میخواین؟

source: From your game,
fa: از بازی شما،

source: Citizen and
fa: شهروند و

source: Mafia ,went out!
fa: مافیا بیرون رفتند

source: And also, Word just came in that Sherlock has left the game!
fa: و همچنین از بالا خبر رسید شرلوک هم از بازی بیرون رفته!

source: Alright, so no inquiry will be made!
fa: خیلی خب پس استعلام گرفته نمیشه!

source: Well, The inquiries are all finished now...
fa: 'خب استعلامم که تموم شده...'

source: Your vote has been registered
fa: رای شما ثبت شد!

source: 🔴Do you want to make an inquiry? List of requesters:
fa: 🔴آیا استعلام میخواین؟ لیست درخواست کنندگان:

source: Your vote has already been registered
fa: رای شما قبلا ثبت شده است

source: You cannot make a request
fa: شما نمی توانید درخواست دهید

source: I want✋
fa: من میخوام

source: 🟠 Who wants a challenge from
fa: 🟠 کی چالش می خواد از

source: List of people who are requesting a challenge from you:
fa: لیست کسایی که ازت چالش می‌خوان:

source: You have already made a request
fa: شما قبلا درخواست داده اید

source: The challenge has been selected!
fa: چالش انتخاب شد!

source: It seems like we don't have any challenges after all
fa: هیچ چالشی هم که انگار نداریم.

source: it is turn to challenge which given to
fa: نوبت چالش دوست مون

source: Dear friend, your challenge time is over!
fa: دوست عزیز زمان چالش شما تمام شد!

source: Dear friend
fa: دوست عزیز

source: Please speak:
fa: بفرمایید صحبت کنید:

source: Dear friend, your chatting time is over!
fa: دوست عزیز زمان صحبت شما تمام شد!

source: Message from
fa: پیام از

source: 🔴The Mafia chat's time is up
fa: 🔴زمان چت مافیا به پایان رسید

source: Alright, dear friends, we have reached the 'Trust Decision' stage (Key Ace), and initially,you can freely talk for three minutes
fa: خیلی خب دوستان عزیز به مرحله کی آس رسیدیم و شما درابتدا می تونید آزادانه سه دقیقه صحبت کنید

source: Alright, the talking time is over, and now it's time for all three of you to come into my private messages (PV) and write who you trust as the citizen!
fa: خیلی خب زمان صحبت تموم شد و الان وقتشه هر سه بیاین داخل پیوی من و بنویسید به کی اعتماد دارید که شهرونده!

source: Tell me, who do you trust as the citizen?
fa: بگو ببینم کی رو تو به عنوان شهروند بهش اعتماد داری؟

source: Your opinion has been received!
fa: نظرت دریافت شد!

source: According to the result,
fa: با توجه به نتایج،

source: have been chosen as the citizen. From now on, you have 30 seconds to decide who to shake hands with!
fa: به عنوان فرد شهروند شما انتخاب شداز الان تا سی ثانیه وقت داری تا انتخاب کنی با چه کسی دست بدی

source: Which one of your friends are you choosing to shake hands with?
fa: کدوم یکی از دوستان رو برای دست دادن انتخاب می کنی؟

source: With your choice, the Mafia won the game, and the town lost! 🔥🔥
fa: با انتخاب شما، مافیا بازی رو برد و شهر باخت🔥🔥

source: With your choice, the Mafia lost the game, and the town won! 🔥🔥
fa: با انتخاب شما، مافیا بازی رو باخت و شهر برد🔥🔥

source: Because you didn't make a choice, the Mafia won the game, and the town lost! 🔥🔥
fa: بدلیل اینکه شما انتخاب نکردید، مافیا بازی رو برد و شهر باخت🔥🔥

source: I vote
fa: رای میدم

source: 🟠 We vote for
fa: رای گیری می کنیم برای

source: So
fa: خب پس

source: goes to the defense
fa: به دفاع میره...

source: List of voters:
fa: لیست رای دهندگان:

source: Your vote was registered for him/her!
fa: 'رای شما برای ایشان ثبت شد'

source: You have already voted once!
fa: 'شما قبلا یکبار رای داده اید!'

source: Alright, dear
fa: خب دوست عزیز،

source: , it's your turn for the defense! Go ahead and start. If you finish your defense early, use the phrase 'end of statement' to conclude
fa: شما اومدید توی دفاعیه! شروع کنید اگه دفاع تون زودتر تموم میشه از همون کلمه ی اتمام کلام استفاده کنید

source: Dear friend, your defense time is over!
fa: دوست عزیز زمان دفاع شما تمام شد!

source: We vote for
fa: رای گیری می کنیم برای

source: Oops!, Enough Votes...
fa: اوه آرا کافی است...'

source: Well, we have no defense...
fa: خب پس هیچ دفاعی نداریم...

source: Well, according to result,
fa: خب طبق نتیجه،

source: is out of the game
fa: از بازی خارج میشن

source: According to the result, They will not be out of the game!
fa: طبق نتیجه هیچکدوم از بازی خارج نمیشین!

source: Well, it's like we have to go for the lottery of death (Death draw)
fa: 'خب مثل اینکه باید بریم واسه قرعه مرگ'

source: must choose!
fa: باید انتخاب کنه

source: First Card💀
fa: کارت اول💀

source: Second Card💀
fa: کارت دوم💀

source: The Death draw is like this, the one I choose, tells me which card he chooses between card one and two, and one of these cards is blue, and if he chooses blue, he stays in the game, but if he chooses red, the second defender stays in the game! Now, which one should you choose?
fa: 'فرعه مرگ به این شکله اونی که من انتخاب می کنم،به من میگه که بین کارت یک و دو کدوم رو انتخاب می کنه و یکی از این ها کارت آبی هست و اگه آبی رو انتخاب کنه توی بازی میمونه ولی اگه قرمز رو انتخاب کنه، دفاع کننده دوم توی بازی میمونه! حالا انتخاب کن کدوم؟

source: I congratulate
fa: بهت تبریک می گم

source: ! You are saved!
fa: ! تو نجات پیدا کردی!

source: Luck was not kind to you
fa: بخت باهات یار نبود متاسفانه!

source: ,You kicked out of the game!
fa: از بازی اخراجی

source: Sherlock, wake up, come to my PV :)
fa: شرلوک بیدار شو بیا پیوی مون:)

source: No
fa: نه

source: Sherlock wake up! Do you want to slaughter someone tonight?
fa: شرلوک بیدار شو! آیا امشب میخوای کسی رو سلاخی کنی؟

source: Sherlock, sleep, relax...
fa: 'شرلوک بخواب راحت باش'

source: Simple Mafia
fa: 'مافیا ساده'

source: Mafia, wake up, I gave you a message
fa: مافیا بیدار شه بیا پیوی بهت مسیج دادم

source: Names of mafia members:
fa: نام اعضای مافیا :

source: Wake up! Send any message you want forty seconds early So that your friend will read it
fa: بیدار شو! ده ثانیه زود هرپیامی میخوای بفرست تا یار هات بخونن'

source: I slaughter
fa: سلاخی می کنم

source: I shoot
fa: شلیک می کنم

source: godfather, do you play slaughter or shoot?
fa: پدرخوانده بازی سلاخی می کنی یا شلیک می کنی؟

source: I don't shoot
fa: شلیک نمی کنم

source: I handcuff
fa: دستبند میزنم

source: I don't handcuff
fa: دستبند نمیزنم

source: Matador, are you handcuffing anyone?
fa: ماتادور، آیا دستبند می زنی؟

source: Saul, now that the godfather is not there, tell me, will you shoot or not??
fa: ساول حالا که پدرخوانده نیست تو بگو شلیک می کنی یا نه؟؟

source: I negotiate
fa: مذاکره می کنم

source: I don't negotiate
fa: مذاکره نمی کنم

source: Saul Goodman, Cunning Mafia, Do You Negotiate?
fa: ساول گودمن، مافیای حیله گر، آیا مذاکره می کنی؟

source: Well brother, you have done your work, go to sleep!
fa: خب داداش تو که کارتو کردی بخواب!

source: simple mafia, do you shoot?
fa: مافیا ساده آیا شلیک می کنی؟

source: Sleep well mafia!
fa: مافیای جیگر آروم بخواب

source: Doctor
fa: دکتر

source: Come doctor, we have a sick patient!
fa: دکتر بیاد پیوی مریض داریم!

source: Dr of city, do you want to save someone?
fa: دکتر شهر، آیا کسی رو می خوای نجات بدی؟

source: Leon
fa: لئون

source: Professional Leon, wake up, let's see what you are doing!
fa: لئون حرفه ای مون بیدارشو بیا ببینیم چیکار می کنی!

source: Leon, do you want to shoot someone?
fa: لئون، آیا کسی رو می خوای با تیر بزنی؟

source: Kein
fa: شهروند کین

source: Citizen Kein, wake up and tell me you are asking?!
fa: شهروند کین بیدارشو ببینیم استعلام میگیری یا نه!

source: Citizen Kein, do you want to question someone?
fa: شهروند کین، آیا کسی رو می خوای استعلام بگیری؟

source: Well, you've done your own thing and we have to say goodbye! Bye bye!
fa: خب هم ولاتی چیز همشری جان تو هم که کار خودتو کردی و باید باهم خداحافظی کنیم! بای بای!

source: Constantine, do you want to bring someone?
fa: کنستانتین کسی رو میخوای بیاری تو؟پیویم بگو

source: Constantine, do you want to bring someone in?
fa: کنستانتین، آیا کسی رو می خوای بیاری داخل ؟

source: Well, Constantine, you have done your job, take it easy
fa: خب کنستانتین تو هم که کار خودتو کردی راحت باش

source: It's day! Wake up city friends☀️
fa: روز شد! شهر بیدار شه دوستان☀️

source: We had a death last night...
fa: دیشب کشته داشتیم...

source: killed last night:
fa: کشته دیشب:

source: And we had a slaughter, friends
fa: و سلاخی هم داشتیم دوستان

source: We had a slaughter last night
fa: دیشب سلاخی داشتیم عجب...

source: Slaughter last night:
fa: سلاخی دیشب:

source: It's time to announce that the mafia WON the game and the city lost🔥🔥🔥
fa: دیگه وقتشه اعلام کنم که مافیا بازی رو برد و شهر باخت🔥🔥🔥

source: The city means you... WON🔥🔥🔥
fa: 🔥🔥🔥شهر یعنی شماهااا! شهر پیروز شددد

source: Choose who you want to slaughter?
fa: انتخاب کن کیو میخوای که سلاخی کنی؟

source: Unfortunately, you can't do anything with a handcuff
fa: متاسفانه دستبند داری نمی تونی کاری کنی

source: Slaughter is correct and done. Your role from now on:
fa: سلاخی درسته و انجام شد.نقش شما از این به بعد:

source: You said wrong, Sherlock!
fa: اشتباه گفتی شرلوک!

source: What role do you think {} has?
fa: فکر می کنی {} چه نقشی داره؟

source: The godfather is slaughtering
fa: پدرخوانده در حال سلاخی شهروند

source: Slaughter is correct and done!
fa: سلاخی درسته و انجام شد

source: You said wrong, Senior Godfather!
fa: اشتباه گفتی سنیور پدرخوانده!

source: Choose who you want to kill?
fa: انتخاب کن کیو میخوای که بکشی؟

source: {} Shoot to {}
fa: {} به {} شلیک کرد

source: Done
fa: انجام شد!

source: Your shot is done!
fa: شلیکت نشست!

source: Choose who you want to handcuff?
fa: انتخاب کن کیو میخوای دستبند بزنی؟

source: {} handcuffed to {}
fa: {} به {} دستبند زد

source: Ok, I understand, Matador
fa: اوکی فهمیدم ماتادور

source: Choose who you want to buy?
fa: انتخاب کن کیو میخوای خریداری کنی؟

source: Simple Citizen
fa: شهروند ساده

source: Your role is out of the game and now you are a simple mafia! Saul Goodman bought you
fa: نقش تو از بازی خارج شد و الان مافیای ساده هستی! ساول گودمن تو رو خریداری کرد

source: The purchase was made! Now,
fa: خریداری انجام شد! اکنون

source: became a member of the mafia team
fa: جز تیم مافیا شد

source: Unfortunately, the purchase did not sit!
fa: متاسفانه خریداری نشسته نشد!

source: Choose who you want to save?
fa: انتخاب کن کیو میخوای نجات بدی؟

source: Alright Doctor! Go to sleep
fa: خیلی خب دکی جون بخواب

source: Choose who you want to shoot?
fa: انتخاب کن کیو میخوای که تیر بزنی؟

source: You're out of bullets, man! You are getting old...
fa: تیرهات تموم شده مرد! دیگه پیر شدی...

source: Choose who you want to meet?
fa: انتخاب کن کیو میخوای که باهاش ملاقات کنی؟'

source: Your research is done! If it is true, I will tell you the result today.
fa: تحقیقاتت انجام شد! اگه درست باشه نتیجه رو روز میگم بهت'

source: Your research is done! If it is correct, I will tell you the result today
fa: تحقیقاتت انجام شد! اگه درست باشه نتیجه رو روز میگم بهت

source: Choose who you want to save from the dead?
fa: انتخاب کن کیو میخوای از کسایی مردند نجات بدی؟

source: Ok i got it Constantine!
fa: اوکی فهمیدم کنستانتین

source: Ok Sherlock!
fa: اوکی شرلوک

source: Ok smart Matador
fa: اوکی ماتادور باهوش

source: Ok Matador! I got it!
fa: اوکی ماتادور فهمیدم

source: Ok Sual Goodman
fa: اوکی ساول

source: Ok Sual! lets pass it
fa: اوکی ساول! بیا بگذریم

source: ok my mafia😎
fa: اوکی مافیای من😎

source: Ok Doctor!
fa: اوکی دکتر

source: Ok Leon
fa: اوکی لئون

source: Ok Kein
fa: اوکی کین

source: Ok Constantine, Goddess of birth
fa: اوکی کنستانتین الهه تولد!
